{
  "title": "rustLink Codebase Refactoring and Reorganization",
  "branchName": "main",
  "userStories": [
    {
      "id": "US-001",
      "title": "Reorganize routes module into subdirectories",
      "description": "As a developer, I want the routes module organized into logical subdirectories so that I can easily find and modify specific handlers.",
      "priority": 1,
      "passes": true
    },
    {
      "id": "US-002",
      "title": "Extract route handlers into separate modules by domain",
      "description": "As a developer, I want route handlers grouped by domain (url, auth, admin) so I can quickly locate the code for a specific endpoint.",
      "priority": 2,
      "passes": true
    },
    {
      "id": "US-003",
      "title": "Extract router configuration into separate module",
      "description": "As a developer, I want router setup (rate limiting, CORS, middleware) in a dedicated module so changes to routing don't require scrolling through handler code.",
      "priority": 3,
      "passes": true
    },
    {
      "id": "US-004",
      "title": "Extract route-specific types and responses",
      "description": "As a developer, I want request/response types specific to routes in a separate module so the type definitions don't clutter the handler code.",
      "priority": 4,
      "passes": true
    },
    {
      "id": "US-005",
      "title": "Move AppState to dedicated state module",
      "description": "As a developer, I want application state management in a dedicated module so the shared state structure is clearly documented and easy to modify.",
      "priority": 5,
      "passes": true
    },
    {
      "id": "US-006",
      "title": "Refactor config.rs into focused submodules",
      "description": "As a developer, I want configuration split into logical sections (server, database, cache, rate limiting) so I can quickly find and modify specific config areas.",
      "priority": 6,
      "passes": true
    },
    {
      "id": "US-007",
      "title": "Extract server startup logic from main.rs",
      "description": "As a developer, I want server startup logic in a separate module so main.rs focuses only on CLI parsing and application entry.",
      "priority": 7,
      "passes": false
    },
    {
      "id": "US-008",
      "title": "Extract short code generation to dedicated service",
      "description": "As a developer, I want short code generation logic in a dedicated module so it's reusable and testable independently from HTTP handlers.",
      "priority": 8,
      "passes": true
    },
    {
      "id": "US-009",
      "title": "Create utilities module for shared helpers",
      "description": "As a developer, I want a centralized utilities module for shared helper functions that don't belong in any specific domain module.",
      "priority": 9,
      "passes": true
    },
    {
      "id": "US-010",
      "title": "Update CLAUDE.md with new file structure",
      "description": "As a developer, I want the documentation to reflect the new codebase organization so future contributors can understand the updated structure.",
      "priority": 10,
      "passes": true
    }
  ]
}
